<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7af6171d567345814e5c5f0c976e69f9c77a81e4abf9c8aa8d5d795c717a8be8","plan_job_ref":"Job terraform-plan-05-aws-complete #101 at https://github.com/pipetail/terraform/actions/runs/6397885351","plan_hash":"330fd6a91b59044be97088231de1743203661114356458bc2d5e319466dc625e","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 4 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "nginx-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                  replicaCount: 3
                  resources:
                    limits:
                      memory: 128Mi
                    requests:
                      cpu: 100m
                      memory: 128Mi
                  podAnnotations:
                    prometheus.io/scrape: "true"
                    prometheus.io/path: "/metrics"
                    prometheus.io/port: "10254"
                    prometheus.io/scheme: "http"
                    log: "true"
                  podLabels:
                    app: nginx-ingress
                    release: nginx-prod
                
                  ingressClass: "nginx"
                
                  publishService:
                    enabled: true
                
                  metrics:
                    enabled: true
                
                  service:
                    externalTrafficPolicy: Cluster
                    type: NodePort
                    nodePorts:
                      http: 30080
                      https: 30443
                
                  admissionWebhooks:
                    enabled: false
                
                  config:
                    proxy-body-size: "500M"
                    proxy-buffer-size: "256k"
                    use-forwarded-headers: "true"
                    client-header-buffer-size: "256k"
                
                defaultBackend:
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "4.6.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] is tainted, so must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ arn                  = "arn:aws:eks:eu-west-1:175912345102:addon/complete-example-prod/aws-ebs-csi-driver/38c56b33-f031-5a8a-fb01-8f36e7127fd9" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-09-27T11:30:46Z" -> (known after apply)
      ~ id                   = "****************************************" -> (known after apply)
      ~ modified_at          = "2023-09-27T11:30:59Z" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] is tainted, so must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ arn                  = "arn:aws:eks:eu-west-1:175912345102:addon/complete-example-prod/coredns/c6c56b33-f02e-bf06-3f1c-512d2df75e9f" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-09-27T11:30:46Z" -> (known after apply)
      ~ id                   = "*****************************" -> (known after apply)
      ~ modified_at          = "2023-09-27T11:30:55Z" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "complete-example-prod-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "complete-example-prod-eks-irsa"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
          + "06b25927c42a721631c1efd9431e648fa62e1e39",
          + "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c",
          + "055fe77d0e22309f2488e349e871240040876d28",
        ]
      + url             = "https://oidc.eks.eu-west-1.amazonaws.com/id/01FEF3C156442B18FFA3CA05573BD27C"
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #101](https://github.com/pipetail/terraform/actions/runs/6397885351)